```
[array]
  > number : 1
  > number : 2
  > number : 3
[separator]
  > string
-----------------------
-> return : 123
```

```
[array]
  > number : 1
  > number : 2
  > number : 3
[separator]
  > string : =
-----------------------
-> return : 1=2=3
```
