```
[string]
  > string : 100
[base]
  > number : 2
----------------------
-> return : 4
```

```
[string]
  > string : 100
[base]
  > number: 16
----------------------
-> return : 256
```
