Division of numbers. This function returns Quotient.
Decimal points are round down.
<br/>
**[Example]**
*Ex01)*
```
[dividend]
  > number : 10
[divisor]
  > number : 2
----------------------------
  -> return : 5
```
*Ex02)*
```
[dividend]
  > number : 10
[divisor]
  > number : 3
----------------------------
  -> return : 3
```

