```
[array]
  > number : 1
  > number : 2
  > number : 3
[element]
  > number : 0
-----------------------
-> return : [1, 0, 2, 0, 3]
```

```
[array]
  > number : 1
[element]
  > number : 0
-----------------------
-> return : [1]
```