```
[array]
  > number : 1
  > number : 2
  > number : 3
[index]
  > number : 1
[value]
  > string : autoflow
-----------------------
-> return : [1,"autoflow",3]
```

```
[array]
  > number : 1
  > number : 2
  > number : 3
[index]
  > number : 2
[value]
  > string : autoflow
-----------------------
-> return : [1,2,"autoflow"]
```
