```
[array]
  > number : 1
  > number : 2
  > number : 3
[with]
  > number : 2
  > number : 3
  > number : 4
-----------------------
-> return : [2, 3]
```

```
[array]
  > number : 1
  > number : 2
[with]
  > number : 3
  > number : 4
-----------------------
-> return : []
```