```
[string]
  > string : 100
[base]
  > number : 8
-------------------------
-> return : @
```

```
[string]
  > string : 125
[base]
  > number : 16
-------------------------
-> return : %
```