```
[array]
  > number : 1
  > number : 2
  > number : 3
[value]
  > number : 1
  > number : 2
-----------------------
-> return : true
```

```
[array]
  > number : 1
  > number : 2
[value]
  > number : 1
  > number : 2
  > number : 3
-----------------------
-> return : false
```
