
- base : Accepts an option to specify the base number from 2 to 36.

**[Example]**
*Ex01)*
```
[string]
  > string : foobar
[base]
  > number : 16
[case]
  > upper
-------------------------
-> return : 666F6F626172
```
*Ex02)*
```
[string]
  > string : foobar
[base]
  > number : 8
[case]
  > lower
-------------------------
-> return : 3146755730460562
```
