```
[array]
  > number : 1
  > number : 2
  > number : 3
[count]
  > number : 2
-----------------------
-> return : [3]
```

```
[array]
  > number : 1
  > number : 2
  > number : 3
[count]
  > number : 0
-----------------------
-> return : [1,2]
```
