```
[string]
  > string : autoflow
[count]
  > number : 2
----------------------------
-> return : autoflowautoflow
```

```
[string]
  > string : abcdefg
[conut]
  > number : 3
----------------------------
-> return : abcdefgabcdefgabcdefg
```
