```
[object]
  > object
      name : eric
      age : 22
[map]
  > object
      name : first_name
----------------------
-> return : {"first_name" : "eric", "age" : 22}
```

```
[object]
  > object
      a : 1
      b : 2
[map]
  > object
      a : c
      b : d
----------------------
-> return : {"c": 7, "d": 2}
```