```
[object]
  > object
      name : eric
      age : 22
[with]
  > object
      id : 105
      job : devloper
----------------------
-> return : {"name" : "eric", "age" : 22 , "id" : 105 , "job" : "devloper"}
```

```
[object]
  > object
      a : 1
      b : 2
[with]
  > object
      a : 7
      c : 5
----------------------
-> return : {"a":7,"b":2,"d":5}
```