```
[array]
  > number : 1
  > number : 2
  > number : 3
[element]
  > number : 3
-----------------------
-> return : true
```

```
[array]
  > number : 1
  > number : 2
  > number : 3
[element]
  > number : 5
-----------------------
-> return : false
```
