```
[dividend]
  > number : 10
[divisor]
  > number : 2
----------------------------
  -> return : 5
```

```
[dividend]
  > number : 10
[divisor]
  > number : 3
----------------------------
  -> return : 3
```