```
[array]
  > number : 1
  > number : 2
  > number : 3
[count]
  > number : 2
-----------------------
-> return : [[1,2],[3]]
```

```
[array]
  > number : 1
  > number : 2
  > number : 3
[count]
  > number : -5
-----------------------
-> return : [[],[1,2,3]]
```
