```
[object]
  > object
      name : eric
      age : 22
[key]
  > string : age
------------------
-> return : true
```

```
[object]
  > object
      name : eric
      age : 22
[key]
  > string : city
------------------
-> return : false
```